{
  "nop": 0,
  "aconst_null": 1,
  "iconst": 2,
  "lconst": 3,
  "fconst": 4,
  "dconst": 5,
  "bipush": 6,
  "sipush": 7,
  "ldc": 8,
  "ldc_w": 9,
  "ldc2_w": 10,
  "iload": 11,
  "lload": 12,
  "fload": 13,
  "dload": 14,
  "aload": 15,
  "iaload": 16,
  "laload": 17,
  "faload": 18,
  "daload": 19,
  "aaload": 20,
  "baload": 21,
  "caload": 22,
  "saload": 23,
  "istore": 24,
  "lstore": 25,
  "fstore": 26,
  "dstore": 27,
  "astore": 28,
  "iastore": 29,
  "lastore": 30,
  "fastore": 31,
  "dastore": 32,
  "aastore": 33,
  "bastore": 34,
  "castore": 35,
  "sastore": 36,
  "pop": 37,
  "pop2": 38,
  "dup": 39,
  "dup_x1": 40,
  "dup_x2": 41,
  "dup2": 42,
  "dup2_x1": 43,
  "dup2_x2": 44,
  "swap": 45,
  "iadd": 46,
  "isub": 47,
  "imul": 48,
  "idiv": 49,
  "irem": 50,
  "ineg": 51,
  "ishl": 52,
  "ishr": 53,
  "iushr": 54,
  "iand": 55,
  "ior": 56,
  "ixor": 57,
  "iinc": 58,
  "ladd": 59,
  "lsub": 60,
  "lmul": 61,
  "ldiv": 62,
  "lrem": 63,
  "lneg": 64,
  "lshl": 65,
  "lshr": 66,
  "lushr": 67,
  "land": 68,
  "lor": 69,
  "lxor": 70,
  "fadd": 71,
  "fsub": 72,
  "fmul": 73,
  "fdiv": 74,
  "frem": 75,
  "fneg": 76,
  "dadd": 77,
  "dsub": 78,
  "dmul": 79,
  "ddiv": 80,
  "drem": 81,
  "dneg": 82,
  "i2l": 83,
  "i2f": 84,
  "i2d": 85,
  "l2i": 86,
  "l2f": 87,
  "l2d": 88,
  "f2i": 89,
  "f2l": 90,
  "f2d": 91,
  "d2i": 92,
  "d2l": 93,
  "d2f": 94,
  "i2b": 95,
  "i2c": 96,
  "i2s": 97,
  "lcmp": 98,
  "fcmpl": 99,
  "fcmpg": 100,
  "dcmpl": 101,
  "dcmpg": 102,
  "ifeq": 103,
  "ifne": 104,
  "iflt": 105,
  "ifge": 106,
  "ifgt": 107,
  "ifle": 108,
  "if_icmpeq": 109,
  "if_icmpne": 110,
  "if_icmplt": 111,
  "if_icmpge": 112,
  "if_icmpgt": 113,
  "if_icmple": 114,
  "if_acmpeq": 115,
  "if_acmpne": 116,
  "goto": 117,
  "goto_w": 118,
  "tableswitch": 119,
  "lookupswitch": 120,
  "ireturn": 121,
  "lreturn": 122,
  "freturn": 123,
  "dreturn": 124,
  "areturn": 125,
  "return": 126,
  "getstatic": 127,
  "putstatic": 128,
  "getfield": 129,
  "putfield": 130,
  "invokevirtual": 131,
  "invokespecial": 132,
  "invokestatic": 133,
  "invokeinterface": 134,
  "invokedynamic": 135,
  "new": 136,
  "newarray": 137,
  "anewarray": 138,
  "multianewarray": 139,
  "arraylength": 140,
  "athrow": 141,
  "checkcast": 142,
  "instanceof": 143,
  "monitorenter": 144,
  "monitorexit": 145,
  "wide": 146,
  "ifnull": 147,
  "ifnonnull": 148
}